---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalyticalToPhysicalAssociationManager..::..AddAssociation Method
AnalyticalToPhysicalAssociationManager Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AddAssociation(ElementId, ElementId) | Adds a new association between an analytical element and a physical element. |
|  | AddAssociation(ISet<(Of <<'(ElementId>)>>), ISet<(Of <<'(ElementId>)>>)) | Adds a new association between a group of analytical elements and a group of physical elements. |

# See Also

AnalyticalToPhysicalAssociationManager Class

AnalyticalToPhysicalAssociationManager Members

Autodesk.Revit.DB.Structure Namespace